import { createStyles, makeStyles, Theme } from "@material-ui/core/styles";
import Container from "@material-ui/core/Container";

const useStyles = makeStyles((theme: Theme) =>
  createStyles({
    container: {
      marginTop: theme.spacing(2),
    },
    table: {
      minWidth: 650,
    },
    tableSpace: {
      marginTop: 20,
    },
  })
);

function Home() {
  const classes = useStyles();

  return (
    <div>
      <Container className={classes.container} maxWidth="md">
        <h1 style={{ textAlign: "center" }}>ระบบการเก็บข้อมูลจากห้องปฏิบัติการ (Lab)</h1>
        <h4><u>Requirements</u></h4>
        <p>
        ระบบประวัติผู้ป่วยของโรงพยาบาลแห่งหนึ่ง เป็นระบบที่ให้ผู้ใช้ระบบทำการกรอกข้อมูลประวัติผู้ป่วย
        เพื่อทำการลงทะเบียนเป็นเวชระเบียนผู้ป่วยในสังกัดของโรงพยาบาล ทำการเก็บข้อมูลส่วนตัว ซักประวัติและอาการเบื้องต้นของผู้ป่วย
        ที่เข้ามารับการรักษาที่โรงพยาบาล ระบบเก็บข้อมูลจากห้องปฏิบัติการเป็นระบบที่นักเทคนิคการแพทย์จะทำการตรวจผู้ป่วยด้วยการ
        ส่งสิ่งตรวจของผู้ป่วยเข้าห้องปฏิบัติการ เช่น การตรวจผลเลือดหรือสิ่งอื่นๆที่ไม่สามารถตรวจจากภายนอกได้แยกตามแต่ละประเภทการตรวจ 
        และผู้ใช้ระบบซึ่งเป็นนักเทคนิคการแพทย์ทำการตรวจและบันทึกผลการตรวจจากห้องปฏิบัติการลงในระบบ 
        จากนั้นนักเทคนิคการแพทย์ยังสามารถส่งต่อผลการตรวจจากห้องปฏิบัติการที่สามารถบอกถึงข้อมูลสำคัญเพื่อให้แพทย์
        นำไปใช้ในการประกอบการวินิจฉัยและวิเคราะห์หาวิธีการรักษาโรคของผู้ป่วยต่อได้
        </p>
        <br />
        <h4><u>User Story</u> (ระบบการเก็บข้อมูลจากห้องปฏิบัติการ (Lab))</h4>
        <p> 
          <b>ในบทบาทของ</b>	นักเทคนิคการแพทย์<br />
          <b>ฉันต้องการ</b>	บันทึกผลการตรวจจากห้องปฏิบัติการ<br />
          <b>เพื่อ</b>	เก็บข้อมูลผลการตรวจจากห้องปฏิบัติการเพื่อให้บุคลากรทางการแพทย์สามารถนำไปใช้ในการวิเคราะห์ ค้นหาโรคและวิธีการรักษาผู้ป่วย<br />
        </p>
      </Container>
    </div>
  );
}
export default Home;